frontEnd/app/Http/Controllers/CoinController.php

select * from `coins` where `type` = 'commemorative' limit 15 offset 0
select count(*) as aggregate from `coins` where `type` = 'commemorative'
select `year`, `id` from `years`
select distinct `countries`.`country_name`, `countries`.`id` from `coins` inner join `countries` on `coins`.`country_id` = `countries`.`id`
select distinct `type` from `coins`
---
    public function catalog($id = null): Factory|View|Application
    {
        if ($id == null) {
            $coins = Coin::paginate(15);
        } else {
            $coins = Coin::where('type', $id)->paginate(15);
        }
        return view("/coins/catalog",
            ["coins" => $coins,
                "countrySelect" => Coin::join('countries', 'coins.country_id', '=', 'countries.id')
                    ->select('countries.country_name', 'countries.id')->distinct()->pluck('country_name', 'id'),
                "typeSelect" => Coin::select('type')->distinct()->pluck('type'),
                "yearSelect" => Year::pluck('year', 'id')]);

insert into `collection` (`coin_id`, `year`, `user_id`, `updated_at`, `created_at`) values ('4', '2007', 4, '2023-03-30 13:36:01', '2023-03-30 13:36:01')
select count(*) as aggregate from `collection` where `coin_id` = '4' and `year` = '2007' and `user_id` = 4
---
    public function addToMyCollection($coin_id, $year)
    {
        $saveColl = Collection::where('coin_id', $coin_id)->where('year', $year)->where('user_id', auth()->id());
        ($saveColl->count() !== 0) ? $saveColl->delete() : Collection::create(['coin_id' => $coin_id, 'year' => $year, 'user_id' => auth()->id()]);

select * from `coins` inner join `countries` on `countries`.`id` = `coins`.`country_id` where `type` = 'circulation' limit 15 offset 0
select count(*) as aggregate from `coins` inner join `countries` on `countries`.`id` = `coins`.`country_id` where `type` = 'circulation'
select distinct `type` from `coins`
select `year`, `id` from `years`
select distinct `countries`.`country_name`, `countries`.`id` from `coins` inner join `countries` on `coins`.`country_id` = `countries`.`id`
---
    public function selectCoin(Request $request)
    {
        $cs = $request->countrySelect;
        $ts = $request->typeSelect == 0 ? 'circulation' : 'commemorative';
        $ys = $request->yearSelect;
        $query = Coin::query();
        $query->join('countries', 'countries.id', '=', 'coins.country_id');
        if ($cs) {
            $query->where('country_id', $cs)->where('type', $ts);
        }
        if ($ys) {
            $year = Year::find($ys);
            $query->whereJsonContains('year', $year->year)->where('type', $ts);
        }
        $query->where('type', $ts);
        $coins = $query->paginate(15);

        return view("/coins/catalog",
            ["coins" => $coins,
                "countrySelect" => Coin::join('countries', 'coins.country_id', '=', 'countries.id')
                    ->select('countries.country_name', 'countries.id')->distinct()->pluck('country_name', 'id'),
                "typeSelect" => Coin::select('type')->distinct()->pluck('type')->toArray(),
                "yearSelect" => Year::pluck('year', 'id'),
                "ts" => $ts]);

select * from `coins` where `coins`.`id` = '8' limit 1
---
    public function detailedCoin($id): Factory|View|Application
    {
        return view("coins/detailedCoin",
            ["detailedCoin" => Coin::find($id)]);