frontEnd/app/Http/Controllers/MenuController.php

    public function all(): Factory|View|Application
    {
        $countCirc = Coin::where('type', 'circulation')->count();
        $countComm = Coin::where('type', 'commemorative')->count();
        $collectionCount = null;
        if (auth()->check()) {
            $collectionCount = Coin::join('collection', 'collection.coin_id', '=', 'coins.id')
                ->where('collection.user_id', auth()->id())
                ->select(DB::raw('count(*) as count, type'))
                ->groupBy('type')
                ->pluck('count', 'type');
---
select count(*) as aggregate from `coins` where `type` = 'circulation'
select count(*) as count, type from `coins` inner join `collection` on `collection`.`coin_id` = `coins`.`id` where `collection`.`user_id` = 7 group by `type`