frontEnd/app/Http/Controllers/PlaceController.php

    public function all()
    {
        return view("/places/places",
            ["countries" => Coin::join('countries', 'coins.country_id', '=', 'countries.id')
                ->select('countries.country_name', 'countries.id')->distinct()->pluck('country_name', 'id'),
                "places" => Place::paginate(20)]);
---
select distinct `countries`.`country_name`, `countries`.`id` from `coins` inner join `countries` on `coins`.`country_id` = `countries`.`id`
select count(*) as aggregate from `places`

    public function addPlace()
    {
        return view("/places/addPlace", ["countries" => Coin::join('countries', 'coins.country_id', '=', 'countries.id')
            ->select('countries.country_name', 'countries.id')->distinct()->pluck('country_name', 'id')]);
---
select distinct `countries`.`country_name`, `countries`.`id` from `coins` inner join `countries` on `coins`.`country_id` = `countries`.`id`

    public function store(Request $request)
    {
        $request->validate([
            'city_name' => 'required|string|min:2|max:50',
            'postcode' => 'required',
            'street_name' => 'required|string|min:10|max:50',
        ]);
        Place::create($request->only(['city_name', 'postcode', 'street_name', 'country_id', 'latitude', 'longitude']));

        $countries = Coin::join('countries', 'coins.country_id', '=', 'countries.id')
            ->select('countries.country_name', 'countries.id')
            ->distinct()
            ->pluck('country_name', 'id');
---
select distinct `countries`.`country_name`, `countries`.`id` from `coins` inner join `countries` on `coins`.`country_id` = `countries`.`id`

    public function update(Request $request)
    {
        $place = Place::find($request->id);
        $request->validate([
            'city_name' => 'required|string|min:2|max:50',
            'postcode' => 'required',
            'street_name' => 'required|string|min:10|max:50',
        ]);
        $place->city_name = $request->city_name;
        $place->postcode = $request->postcode;
        $place->street_name = $request->street_name;
        $place->country_id = $request->selectCountry;
        $place->latitude = $request->latitude;
        $place->longitude = $request->longitude;
        $place->save();

        $countries = Coin::join('countries', 'coins.country_id', '=', 'countries.id')
            ->select('countries.country_name', 'countries.id')
            ->distinct()
            ->pluck('country_name', 'id');

        $places = Place::all();

        return redirect()->back()->with(compact('countries', 'places'));
---
select * from `places` where `places`.`id` = '102' limit 1
select * from `places` where `id` in ('11')

    public function delete($id)
    {
        Place::destroy($id);
---
delete from `places` where `id` = 11