frontEnd/app/Http/Controllers/ProfileController.php

select `id`, `country_name` from `countries`
---
    public function profile()
    {
        return view("/profile",
            ["countries" => Country::select("id", "country_name")->get()]);