frontEnd/app/Http/Controllers/StatController.php

select `coin_id` from `collection` where `user_id` = 4
select distinct `country_id` from `coins`
select count(coins.id) as coin_id, country_name from `coins` left join `countries` on `coins`.`country_id` = `countries`.`id` group by `countries`.`country_name`
select `country_name`, `country_image` from `countries` where `id` in (6, 15, 22, 55, 58, 69, 74, 75, 82, 85, 97, 106, 109, 122, 128, 129, 137, 146, 156, 178, 191, 199, 200, 205)
select `countries`.`country_name`, `countries`.`id`, count(DISTINCT coins.id) as coin_count from `coins` inner join `collection` on `coins`.`id` = `collection`.`coin_id` inner join `countries` on `coins`.`country_id` = `countries`.`id` where `collection`.`user_id` = 4 group by `countries`.`country_name`, `countries`.`id`
select count(*) as aggregate from `coins`
---
    public function statistics(): Factory|View|Application
    {
        $userId = auth()->id();
        $totalCoinsUser = Collection::where('user_id', $userId)->pluck('coin_id')->toArray();
        $countryId = Coin::distinct()->pluck('country_id');
        $coins = Coin::selectRaw('count(coins.id) as coin_id, country_name')
            ->leftJoin('countries', 'coins.country_id', '=', 'countries.id')
            ->groupBy('countries.country_name')->get();
        $countsPerCountry = [];
        foreach ($coins as $coin) {
            $countsPerCountry[$coin->country_name] = $coin->coin_id;
        }
        $countries = Country::select('country_name', 'country_image')->whereIn('id', $countryId)->get();
        $totalCoinsUserPerCountry = Coin::join('collection', 'coins.id', '=', 'collection.coin_id')
            ->join('countries', 'coins.country_id', '=', 'countries.id')
            ->where('collection.user_id', $userId)
            ->select('countries.country_name', 'countries.id', DB::raw('count(DISTINCT coins.id) as coin_count'))
            ->groupBy('countries.country_name', 'countries.id')
            ->get();
        foreach ($countries as $country) {
            $country->coinCount = $countsPerCountry[$country->country_name];
            foreach ($totalCoinsUserPerCountry as $coinUserPerCountry) {
                if ($coinUserPerCountry->country_name == $country->country_name) {
                    $country->coinCountUser = $coinUserPerCountry->coin_count;
                }
            }
        }
        return view("/statistics",
            ["totalCoins" => Coin::count(),
                "totalCoinsUser" => count($totalCoinsUser),
                "totalCoinsUserPerCountry" => $totalCoinsUserPerCountry,
                "countries" => $countries]);