frontEnd/app/Http/Controllers/UserController.php

    public function detailedUser($id): View|Factory|RedirectResponse|Application
    {
        $detailedUser = User::find($id);
        if (auth()->id() == $id) {
            return redirect()->action([ProfileController::class, "profile"]);
        }
        if (!$detailedUser) {
            return redirect()->action([UserController::class, "all"]);
        }
        return view("users/detailedUser",
            ["detailedUser" => $detailedUser,
                "coins" => Coin::join('collection', 'coins.id', '=', 'collection.coin_id')
                    ->select('coins.*', DB::raw('GROUP_CONCAT(DISTINCT collection.year ORDER BY collection.year ASC SEPARATOR " - ") as userCoinInYears'))
                    ->where('collection.user_id', $id)
                    ->groupBy('coins.id')
                    ->distinct()
                    ->paginate(8),
                "countCollection" => Collection::where('user_id', $id)->count()]);
---
select * from `users` where `users`.`id` = '8' limit 1
select count(*) as aggregate from `collection` where `user_id` = '8'
select count(*) as aggregate from `coins` inner join `collection` on `coins`.`id` = `collection`.`coin_id` where `collection`.`user_id` = '5'
select count(*) as aggregate from `collection` where `user_id` = '5'
select distinct `coins`.*, GROUP_CONCAT(DISTINCT collection.year ORDER BY collection.year ASC SEPARATOR " - ") as userCoinInYears from `coins` inner join `collection` on `coins`.`id` = `collection`.`coin_id` where `collection`.`user_id` = '8' group by `coins`.`id` limit 8 offset 0