frontEnd/app/Http/Controllers/UserController.php

    public function all(): Factory|View|Application
    {
        $users = User::select("id", "nickname", "avatar", "country_id", "created_at")
            ->withCount('collection')->where("id", "!=", auth()->id())
            ->whereIn('country_id', Country::pluck('id')->unique())
            ->get();

        $countries = Country::pluck('country_name', 'id')
            ->only($users->pluck('country_id')->unique());
---
select `id`, `nickname`, `avatar`, `country_id`, `created_at`, (SELECT COUNT(*) FROM collection WHERE collection.user_id = users.id) as coin_count from `users` where `id` != 5
select distinct `countries`.`country_name`, `countries`.`id` from `users` inner join `countries` on `users`.`country_id` = `countries`.`id` where `users`.`id` != 5