frontEnd/app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data): User
    {
        return User::create([
            'nickname' => $data['nickname'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
            'avatar' => $data['avatar'],
            'country_id' => $data['country_id']
        ]);
---
insert into `users` (`nickname`, `email`, `password`, `avatar`, `country_id`, `updated_at`, `created_at`) values ('gaelikkk', 'gaelik@gmail.com', '$2y$10$I2zgBV4Udptodi4qnLr/NedAhvAyaPhEqPMZ2REIwC2heghD7g8pq', 'icon.png', '2', '2023-03-30 10:44:31', '2023-03-30 10:44:31')